RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/i2c_reg.h
    /* 0x10 : i2c_prd_start */
    union {
        struct {
            uint32_t cr_i2c_prd_s_ph_0 : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_i2c_prd_s_ph_1 : 8; /* [15: 8],        r/w,        0xf */
            uint32_t cr_i2c_prd_s_ph_2 : 8; /* [23:16],        r/w,        0xf */
            uint32_t cr_i2c_prd_s_ph_3 : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } i2c_prd_start;

    /* 0x14 : i2c_prd_stop */
    union {
        struct {
            uint32_t cr_i2c_prd_p_ph_0 : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_i2c_prd_p_ph_1 : 8; /* [15: 8],        r/w,        0xf */
            uint32_t cr_i2c_prd_p_ph_2 : 8; /* [23:16],        r/w,        0xf */
            uint32_t cr_i2c_prd_p_ph_3 : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } i2c_prd_stop;

    /* 0x18 : i2c_prd_data */
    union {
        struct {
            uint32_t cr_i2c_prd_d_ph_0 : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_i2c_prd_d_ph_1 : 8; /* [15: 8],        r/w,        0xf */
            uint32_t cr_i2c_prd_d_ph_2 : 8; /* [23:16],        r/w,        0xf */
            uint32_t cr_i2c_prd_d_ph_3 : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } i2c_prd_data;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[100];

    /* 0x80 : i2c_fifo_config_0 */
    union {
        struct {
            uint32_t i2c_dma_tx_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t i2c_dma_rx_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2c_fifo_config_0;

    /* 0x84 : i2c_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 2; /* [ 1: 0],          r,        0x2 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 2; /* [ 9: 8],          r,        0x0 */
            uint32_t reserved_10_15 : 6; /* [15:10],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23 : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2c_fifo_config_1;

    /* 0x88 : i2c_fifo_wdata */
    union {
        struct {
            uint32_t i2c_fifo_wdata : 32; /* [31: 0],          w,          x */
        } BF;
        uint32_t WORD;
    } i2c_fifo_wdata;

    /* 0x8C : i2c_fifo_rdata */
    union {
        struct {
            uint32_t i2c_fifo_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } i2c_fifo_rdata;
};

typedef volatile struct i2c_reg i2c_reg_t;

#endif /* __I2C_REG_H__ */
